virtualabs/cutcutgo/src/packs/ATSAML21J18B_DFP/atsaml21j18b.h
/** \addtogroup SAML21J18B_base b'Peripheral Base Address Definitions'
 *  @{
 */

/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR SAML21J18B                                  */
/* ************************************************************************** */
#define AC_BASE_ADDRESS                  _UL_(0x43001000)                              /**< \brief AC Base Address */
#define ADC_BASE_ADDRESS                 _UL_(0x43000c00)                              /**< \brief ADC Base Address */
#define AES_BASE_ADDRESS                 _UL_(0x42003400)                              /**< \brief AES Base Address */
#define CCL_BASE_ADDRESS                 _UL_(0x43001c00)                              /**< \brief CCL Base Address */
#define DAC_BASE_ADDRESS                 _UL_(0x42003000)                              /**< \brief DAC Base Address */
#define DMAC_BASE_ADDRESS                _UL_(0x44000400)                              /**< \brief DMAC Base Address */
#define DSU_BASE_ADDRESS                 _UL_(0x41002000)                              /**< \brief DSU Base Address */
#define EIC_BASE_ADDRESS                 _UL_(0x40002400)                              /**< \brief EIC Base Address */
#define EVSYS_BASE_ADDRESS               _UL_(0x43000000)                              /**< \brief EVSYS Base Address */
#define GCLK_BASE_ADDRESS                _UL_(0x40001800)                              /**< \brief GCLK Base Address */
#define MCLK_BASE_ADDRESS                _UL_(0x40000400)                              /**< \brief MCLK Base Address */
#define MTB_BASE_ADDRESS                 _UL_(0x41006000)                              /**< \brief MTB Base Address */
#define NVMCTRL_BASE_ADDRESS             _UL_(0x41004000)                              /**< \brief NVMCTRL Base Address */
#define OPAMP_BASE_ADDRESS               _UL_(0x43001800)                              /**< \brief OPAMP Base Address */
#define OSCCTRL_BASE_ADDRESS             _UL_(0x40000c00)                              /**< \brief OSCCTRL Base Address */
#define OSC32KCTRL_BASE_ADDRESS          _UL_(0x40001000)                              /**< \brief OSC32KCTRL Base Address */
#define PAC_BASE_ADDRESS                 _UL_(0x44000000)                              /**< \brief PAC Base Address */
#define PM_BASE_ADDRESS                  _UL_(0x40000000)                              /**< \brief PM Base Address */
#define PORT_BASE_ADDRESS                _UL_(0x40002800)                              /**< \brief PORT Base Address */
#define PORT_IOBUS_BASE_ADDRESS          _UL_(0x60000000)                              /**< \brief PORT Base Address */
#define PTC_BASE_ADDRESS                 _UL_(0x43001400)                              /**< \brief PTC Base Address */
#define RSTC_BASE_ADDRESS                _UL_(0x40000800)                              /**< \brief RSTC Base Address */
#define RTC_BASE_ADDRESS                 _UL_(0x40002000)                              /**< \brief RTC Base Address */
#define SERCOM0_BASE_ADDRESS             _UL_(0x42000000)                              /**< \brief SERCOM0 Base Address */
#define SERCOM1_BASE_ADDRESS             _UL_(0x42000400)                              /**< \brief SERCOM1 Base Address */
#define SERCOM2_BASE_ADDRESS             _UL_(0x42000800)                              /**< \brief SERCOM2 Base Address */
#define SERCOM3_BASE_ADDRESS             _UL_(0x42000c00)                              /**< \brief SERCOM3 Base Address */
#define SERCOM4_BASE_ADDRESS             _UL_(0x42001000)                              /**< \brief SERCOM4 Base Address */
#define SERCOM5_BASE_ADDRESS             _UL_(0x43000400)                              /**< \brief SERCOM5 Base Address */
#define SUPC_BASE_ADDRESS                _UL_(0x40001400)                              /**< \brief SUPC Base Address */
#define TC0_BASE_ADDRESS                 _UL_(0x42002000)                              /**< \brief TC0 Base Address */
#define TC1_BASE_ADDRESS                 _UL_(0x42002400)                              /**< \brief TC1 Base Address */
#define TC2_BASE_ADDRESS                 _UL_(0x42002800)                              /**< \brief TC2 Base Address */
#define TC3_BASE_ADDRESS                 _UL_(0x42002c00)                              /**< \brief TC3 Base Address */
#define TC4_BASE_ADDRESS                 _UL_(0x43000800)                              /**< \brief TC4 Base Address */
#define TCC0_BASE_ADDRESS                _UL_(0x42001400)                              /**< \brief TCC0 Base Address */
#define TCC1_BASE_ADDRESS                _UL_(0x42001800)                              /**< \brief TCC1 Base Address */
#define TCC2_BASE_ADDRESS                _UL_(0x42001c00)                              /**< \brief TCC2 Base Address */
#define TRNG_BASE_ADDRESS                _UL_(0x42003800)                              /**< \brief TRNG Base Address */
#define USB_BASE_ADDRESS                 _UL_(0x41000000)                              /**< \brief USB Base Address */
#define WDT_BASE_ADDRESS                 _UL_(0x40001c00)                              /**< \brief WDT Base Address */
/** @}  b'end of Peripheral Base Address Definitions' */

/** \addtogroup SAML21J18B_pio b'Peripheral Pio Definitions'
 *  @{
 */

/* ************************************************************************** */
/*   PIO DEFINITIONS FOR SAML21J18B                                           */
/* ************************************************************************** */
#include "pio/saml21j18b.h"
/** @}  b'end of Peripheral Pio Definitions' */

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR SAML21J18B                                */
/* ************************************************************************** */

#define FLASH_SIZE                     _UL_(0x00040000)    /*  256kB Memory segment type: flash */
#define FLASH_PAGE_SIZE                _UL_(        64)
#define FLASH_NB_OF_PAGES              _UL_(      4096)

#define CAL_SIZE                       _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define LOCKBIT_SIZE                   _UL_(0x00000004)    /*    0kB Memory segment type: fuses */
#define OTP1_SIZE                      _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP2_SIZE                      _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP3_SIZE                      _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP4_SIZE                      _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP5_SIZE                      _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define TEMP_LOG_SIZE                  _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define USER_PAGE_SIZE                 _UL_(0x00000100)    /*    0kB Memory segment type: user_page */
#define USER_PAGE_PAGE_SIZE            _UL_(        64)
#define USER_PAGE_NB_OF_PAGES          _UL_(         4)

#define RWW_SIZE                       _UL_(0x00002000)    /*    8kB Memory segment type: flash */
#define RWW_PAGE_SIZE                  _UL_(        64)
#define RWW_NB_OF_PAGES                _UL_(       128)

#define HSRAM_SIZE                     _UL_(0x00008000)    /*   32kB Memory segment type: ram */
#define LPRAM_SIZE                     _UL_(0x00002000)    /*    8kB Memory segment type: ram */
#define HPB0_SIZE                      _UL_(0x00004000)    /*   16kB Memory segment type: io */
#define HPB1_SIZE                      _UL_(0x00010000)    /*   64kB Memory segment type: io */
#define HPB2_SIZE                      _UL_(0x00008000)    /*   32kB Memory segment type: io */
#define HPB3_SIZE                      _UL_(0x00002000)    /*    8kB Memory segment type: io */
#define HPB4_SIZE                      _UL_(0x00001000)    /*    4kB Memory segment type: io */
#define PPB_SIZE                       _UL_(0x00100000)    /* 1024kB Memory segment type: io */
#define SCS_SIZE                       _UL_(0x00001000)    /*    4kB Memory segment type: io */
#define PERIPHERALS_SIZE               _UL_(0x20000000)    /* 524288kB Memory segment type: io */

#define FLASH_ADDR                     _UL_(0x00000000)    /**< FLASH base address (type: flash)*/
#define CAL_ADDR                       _UL_(0x00800000)    /**< CAL base address (type: fuses)*/
#define LOCKBIT_ADDR                   _UL_(0x00802000)    /**< LOCKBIT base address (type: fuses)*/
#define OTP1_ADDR                      _UL_(0x00806000)    /**< OTP1 base address (type: fuses)*/
#define OTP2_ADDR                      _UL_(0x00806008)    /**< OTP2 base address (type: fuses)*/
#define OTP3_ADDR                      _UL_(0x00806010)    /**< OTP3 base address (type: fuses)*/
#define OTP4_ADDR                      _UL_(0x00806018)    /**< OTP4 base address (type: fuses)*/
#define OTP5_ADDR                      _UL_(0x00806020)    /**< OTP5 base address (type: fuses)*/
#define TEMP_LOG_ADDR                  _UL_(0x00806030)    /**< TEMP_LOG base address (type: fuses)*/
#define USER_PAGE_ADDR                 _UL_(0x00804000)    /**< USER_PAGE base address (type: user_page)*/
#define RWW_ADDR                       _UL_(0x00400000)    /**< RWW base address (type: flash)*/
#define HSRAM_ADDR                     _UL_(0x20000000)    /**< HSRAM base address (type: ram)*/
#define LPRAM_ADDR                     _UL_(0x30000000)    /**< LPRAM base address (type: ram)*/
#define HPB0_ADDR                      _UL_(0x40000000)    /**< HPB0 base address (type: io)*/
#define HPB1_ADDR                      _UL_(0x41000000)    /**< HPB1 base address (type: io)*/
#define HPB2_ADDR                      _UL_(0x42000000)    /**< HPB2 base address (type: io)*/
#define HPB3_ADDR                      _UL_(0x43000000)    /**< HPB3 base address (type: io)*/
#define HPB4_ADDR                      _UL_(0x44000000)    /**< HPB4 base address (type: io)*/
#define PPB_ADDR                       _UL_(0xe0000000)    /**< PPB base address (type: io)*/
#define SCS_ADDR                       _UL_(0xe000e000)    /**< SCS base address (type: io)*/
#define PERIPHERALS_ADDR               _UL_(0x40000000)    /**< PERIPHERALS base address (type: io)*/

/* ************************************************************************** */
/**  DEVICE SIGNATURES FOR SAML21J18B                                         */
/* ************************************************************************** */
#define CHIP_DSU_DID                   _UL_(0X1081020F)

/* ************************************************************************** */
/**  ELECTRICAL DEFINITIONS FOR SAML21J18B                                    */
/* ************************************************************************** */

/* ************************************************************************** */
/** Event Generator IDs for SAML21J18B */
/* ************************************************************************** */
#define EVENT_ID_GEN_RTC_CMP_0                            1 /**< ID for RTC event generator CMP_0 */
#define EVENT_ID_GEN_RTC_CMP_1                            2 /**< ID for RTC event generator CMP_1 */
#define EVENT_ID_GEN_RTC_OVF                              3 /**< ID for RTC event generator OVF */
#define EVENT_ID_GEN_RTC_PER_0                            4 /**< ID for RTC event generator PER_0 */
#define EVENT_ID_GEN_RTC_PER_1                            5 /**< ID for RTC event generator PER_1 */
#define EVENT_ID_GEN_RTC_PER_2                            6 /**< ID for RTC event generator PER_2 */
#define EVENT_ID_GEN_RTC_PER_3                            7 /**< ID for RTC event generator PER_3 */
#define EVENT_ID_GEN_RTC_PER_4                            8 /**< ID for RTC event generator PER_4 */
#define EVENT_ID_GEN_RTC_PER_5                            9 /**< ID for RTC event generator PER_5 */
#define EVENT_ID_GEN_RTC_PER_6                           10 /**< ID for RTC event generator PER_6 */
#define EVENT_ID_GEN_RTC_PER_7                           11 /**< ID for RTC event generator PER_7 */
#define EVENT_ID_GEN_EIC_EXTINT_0                        12 /**< ID for EIC event generator EXTINT_0 */
#define EVENT_ID_GEN_EIC_EXTINT_1                        13 /**< ID for EIC event generator EXTINT_1 */
#define EVENT_ID_GEN_EIC_EXTINT_2                        14 /**< ID for EIC event generator EXTINT_2 */
#define EVENT_ID_GEN_EIC_EXTINT_3                        15 /**< ID for EIC event generator EXTINT_3 */
#define EVENT_ID_GEN_EIC_EXTINT_4                        16 /**< ID for EIC event generator EXTINT_4 */
#define EVENT_ID_GEN_EIC_EXTINT_5                        17 /**< ID for EIC event generator EXTINT_5 */
#define EVENT_ID_GEN_EIC_EXTINT_6                        18 /**< ID for EIC event generator EXTINT_6 */
#define EVENT_ID_GEN_EIC_EXTINT_7                        19 /**< ID for EIC event generator EXTINT_7 */
#define EVENT_ID_GEN_EIC_EXTINT_8                        20 /**< ID for EIC event generator EXTINT_8 */
#define EVENT_ID_GEN_EIC_EXTINT_9                        21 /**< ID for EIC event generator EXTINT_9 */
#define EVENT_ID_GEN_EIC_EXTINT_10                       22 /**< ID for EIC event generator EXTINT_10 */
#define EVENT_ID_GEN_EIC_EXTINT_11                       23 /**< ID for EIC event generator EXTINT_11 */
#define EVENT_ID_GEN_EIC_EXTINT_12                       24 /**< ID for EIC event generator EXTINT_12 */
#define EVENT_ID_GEN_EIC_EXTINT_13                       25 /**< ID for EIC event generator EXTINT_13 */
#define EVENT_ID_GEN_EIC_EXTINT_14                       26 /**< ID for EIC event generator EXTINT_14 */
#define EVENT_ID_GEN_EIC_EXTINT_15                       27 /**< ID for EIC event generator EXTINT_15 */
#define EVENT_ID_GEN_DMAC_CH_0                           28 /**< ID for DMAC event generator CH_0 */
#define EVENT_ID_GEN_DMAC_CH_1                           29 /**< ID for DMAC event generator CH_1 */
#define EVENT_ID_GEN_DMAC_CH_2                           30 /**< ID for DMAC event generator CH_2 */
#define EVENT_ID_GEN_DMAC_CH_3                           31 /**< ID for DMAC event generator CH_3 */
#define EVENT_ID_GEN_DMAC_CH_4                           32 /**< ID for DMAC event generator CH_4 */
#define EVENT_ID_GEN_DMAC_CH_5                           33 /**< ID for DMAC event generator CH_5 */
#define EVENT_ID_GEN_DMAC_CH_6                           34 /**< ID for DMAC event generator CH_6 */
#define EVENT_ID_GEN_DMAC_CH_7                           35 /**< ID for DMAC event generator CH_7 */
#define EVENT_ID_GEN_TCC0_OVF                            36 /**< ID for TCC0 event generator OVF */
#define EVENT_ID_GEN_TCC0_TRG                            37 /**< ID for TCC0 event generator TRG */
#define EVENT_ID_GEN_TCC0_CNT                            38 /**< ID for TCC0 event generator CNT */
#define EVENT_ID_GEN_TCC0_MC_0                           39 /**< ID for TCC0 event generator MC_0 */
#define EVENT_ID_GEN_TCC0_MC_1                           40 /**< ID for TCC0 event generator MC_1 */
#define EVENT_ID_GEN_TCC0_MC_2                           41 /**< ID for TCC0 event generator MC_2 */
#define EVENT_ID_GEN_TCC0_MC_3                           42 /**< ID for TCC0 event generator MC_3 */
#define EVENT_ID_GEN_TCC1_OVF                            43 /**< ID for TCC1 event generator OVF */
#define EVENT_ID_GEN_TCC1_TRG                            44 /**< ID for TCC1 event generator TRG */
#define EVENT_ID_GEN_TCC1_CNT                            45 /**< ID for TCC1 event generator CNT */
#define EVENT_ID_GEN_TCC1_MC_0                           46 /**< ID for TCC1 event generator MC_0 */
#define EVENT_ID_GEN_TCC1_MC_1                           47 /**< ID for TCC1 event generator MC_1 */
#define EVENT_ID_GEN_TCC2_OVF                            48 /**< ID for TCC2 event generator OVF */
#define EVENT_ID_GEN_TCC2_TRG                            49 /**< ID for TCC2 event generator TRG */
#define EVENT_ID_GEN_TCC2_CNT                            50 /**< ID for TCC2 event generator CNT */
#define EVENT_ID_GEN_TCC2_MC_0                           51 /**< ID for TCC2 event generator MC_0 */
#define EVENT_ID_GEN_TCC2_MC_1                           52 /**< ID for TCC2 event generator MC_1 */
#define EVENT_ID_GEN_TC0_OVF                             53 /**< ID for TC0 event generator OVF */
#define EVENT_ID_GEN_TC0_MC_0                            54 /**< ID for TC0 event generator MC_0 */
#define EVENT_ID_GEN_TC0_MC_1                            55 /**< ID for TC0 event generator MC_1 */
#define EVENT_ID_GEN_TC1_OVF                             56 /**< ID for TC1 event generator OVF */
#define EVENT_ID_GEN_TC1_MC_0                            57 /**< ID for TC1 event generator MC_0 */
#define EVENT_ID_GEN_TC1_MC_1                            58 /**< ID for TC1 event generator MC_1 */
#define EVENT_ID_GEN_TC2_OVF                             59 /**< ID for TC2 event generator OVF */
#define EVENT_ID_GEN_TC2_MC_0                            60 /**< ID for TC2 event generator MC_0 */
#define EVENT_ID_GEN_TC2_MC_1                            61 /**< ID for TC2 event generator MC_1 */
#define EVENT_ID_GEN_TC3_OVF                             62 /**< ID for TC3 event generator OVF */
#define EVENT_ID_GEN_TC3_MC_0                            63 /**< ID for TC3 event generator MC_0 */
#define EVENT_ID_GEN_TC3_MC_1                            64 /**< ID for TC3 event generator MC_1 */
#define EVENT_ID_GEN_TC4_OVF                             65 /**< ID for TC4 event generator OVF */
#define EVENT_ID_GEN_TC4_MC_0                            66 /**< ID for TC4 event generator MC_0 */
#define EVENT_ID_GEN_TC4_MC_1                            67 /**< ID for TC4 event generator MC_1 */
#define EVENT_ID_GEN_ADC_RESRDY                          68 /**< ID for ADC event generator RESRDY */
#define EVENT_ID_GEN_ADC_WINMON                          69 /**< ID for ADC event generator WINMON */
#define EVENT_ID_GEN_AC_COMP_0                           70 /**< ID for AC event generator COMP_0 */
#define EVENT_ID_GEN_AC_COMP_1                           71 /**< ID for AC event generator COMP_1 */
#define EVENT_ID_GEN_AC_WIN_0                            72 /**< ID for AC event generator WIN_0 */
#define EVENT_ID_GEN_DAC_EMPTY_0                         73 /**< ID for DAC event generator EMPTY_0 */
#define EVENT_ID_GEN_DAC_EMPTY_1                         74 /**< ID for DAC event generator EMPTY_1 */
#define EVENT_ID_GEN_TRNG_READY                          77 /**< ID for TRNG event generator READY */
#define EVENT_ID_GEN_CCL_LUTOUT_0                        78 /**< ID for CCL event generator LUTOUT_0 */
#define EVENT_ID_GEN_CCL_LUTOUT_1                        79 /**< ID for CCL event generator LUTOUT_1 */
#define EVENT_ID_GEN_CCL_LUTOUT_2                        80 /**< ID for CCL event generator LUTOUT_2 */
#define EVENT_ID_GEN_CCL_LUTOUT_3                        81 /**< ID for CCL event generator LUTOUT_3 */
#define EVENT_ID_GEN_PAC_ACCERR                          82 /**< ID for PAC event generator ACCERR */

/* ************************************************************************** */
/** Event User IDs for SAML21J18B */
/* ************************************************************************** */
#define EVENT_ID_USER_PORT_EV_0                           0 /**< ID for PORT event user EV_0 */
#define EVENT_ID_USER_PORT_EV_1                           1 /**< ID for PORT event user EV_1 */
#define EVENT_ID_USER_PORT_EV_2                           2 /**< ID for PORT event user EV_2 */
#define EVENT_ID_USER_PORT_EV_3                           3 /**< ID for PORT event user EV_3 */
#define EVENT_ID_USER_DMAC_CH_0                           4 /**< ID for DMAC event user CH_0 */
#define EVENT_ID_USER_DMAC_CH_1                           5 /**< ID for DMAC event user CH_1 */
#define EVENT_ID_USER_DMAC_CH_2                           6 /**< ID for DMAC event user CH_2 */
#define EVENT_ID_USER_DMAC_CH_3                           7 /**< ID for DMAC event user CH_3 */
#define EVENT_ID_USER_DMAC_CH_4                           8 /**< ID for DMAC event user CH_4 */
#define EVENT_ID_USER_DMAC_CH_5                           9 /**< ID for DMAC event user CH_5 */
#define EVENT_ID_USER_DMAC_CH_6                          10 /**< ID for DMAC event user CH_6 */
#define EVENT_ID_USER_DMAC_CH_7                          11 /**< ID for DMAC event user CH_7 */
#define EVENT_ID_USER_TCC0_EV_0                          12 /**< ID for TCC0 event user EV_0 */
#define EVENT_ID_USER_TCC0_EV_1                          13 /**< ID for TCC0 event user EV_1 */
#define EVENT_ID_USER_TCC0_MC_0                          14 /**< ID for TCC0 event user MC_0 */
#define EVENT_ID_USER_TCC0_MC_1                          15 /**< ID for TCC0 event user MC_1 */
#define EVENT_ID_USER_TCC0_MC_2                          16 /**< ID for TCC0 event user MC_2 */
#define EVENT_ID_USER_TCC0_MC_3                          17 /**< ID for TCC0 event user MC_3 */
#define EVENT_ID_USER_TCC1_EV_0                          18 /**< ID for TCC1 event user EV_0 */
#define EVENT_ID_USER_TCC1_EV_1                          19 /**< ID for TCC1 event user EV_1 */
#define EVENT_ID_USER_TCC1_MC_0                          20 /**< ID for TCC1 event user MC_0 */
#define EVENT_ID_USER_TCC1_MC_1                          21 /**< ID for TCC1 event user MC_1 */
#define EVENT_ID_USER_TCC2_EV_0                          22 /**< ID for TCC2 event user EV_0 */
#define EVENT_ID_USER_TCC2_EV_1                          23 /**< ID for TCC2 event user EV_1 */
#define EVENT_ID_USER_TCC2_MC_0                          24 /**< ID for TCC2 event user MC_0 */
#define EVENT_ID_USER_TCC2_MC_1                          25 /**< ID for TCC2 event user MC_1 */
#define EVENT_ID_USER_TC0_EVU                            26 /**< ID for TC0 event user EVU */
#define EVENT_ID_USER_TC1_EVU                            27 /**< ID for TC1 event user EVU */
#define EVENT_ID_USER_TC2_EVU                            28 /**< ID for TC2 event user EVU */
#define EVENT_ID_USER_TC3_EVU                            29 /**< ID for TC3 event user EVU */
#define EVENT_ID_USER_TC4_EVU                            30 /**< ID for TC4 event user EVU */
#define EVENT_ID_USER_ADC_START                          31 /**< ID for ADC event user START */
#define EVENT_ID_USER_ADC_SYNC                           32 /**< ID for ADC event user SYNC */
#define EVENT_ID_USER_AC_SOC_0                           33 /**< ID for AC event user SOC_0 */
#define EVENT_ID_USER_AC_SOC_1                           34 /**< ID for AC event user SOC_1 */
#define EVENT_ID_USER_DAC_START_0                        35 /**< ID for DAC event user START_0 */
#define EVENT_ID_USER_DAC_START_1                        36 /**< ID for DAC event user START_1 */
#define EVENT_ID_USER_CCL_LUTIN_0                        38 /**< ID for CCL event user LUTIN_0 */
#define EVENT_ID_USER_CCL_LUTIN_1                        39 /**< ID for CCL event user LUTIN_1 */
#define EVENT_ID_USER_CCL_LUTIN_2                        40 /**< ID for CCL event user LUTIN_2 */
#define EVENT_ID_USER_CCL_LUTIN_3                        41 /**< ID for CCL event user LUTIN_3 */
#define EVENT_ID_USER_MTB_START                          43 /**< ID for MTB event user START */
#define EVENT_ID_USER_MTB_STOP                           44 /**< ID for MTB event user STOP */

#ifdef __cplusplus
}
#endif

/** @}  b'end of SAML21J18B definitions' */


#endif /* _SAML21J18B_H_ */

